Masmiseim36/iMXRT/targets/iMXRT/devices/iMXRT1160/periph/PERI_SEMC.h
#define SEMC_SRAMCR4_BL_MASK                     (0x70U)
#define SEMC_SRAMCR4_BL_SHIFT                    (4U)
/*! BL - Burst Length
 *  0b000..1
 *  0b001..2
 *  0b010..4
 *  0b011..8
 *  0b100..16
 *  0b101..32
 *  0b110..64
 *  0b111..64
 */
#define SEMC_SRAMCR4_BL(x)                       (((uint32_t)(((uint32_t)(x)) << SEMC_SRAMCR4_BL_SHIFT)) & SEMC_SRAMCR4_BL_MASK)

#define SEMC_SRAMCR4_AM_MASK                     (0x300U)
#define SEMC_SRAMCR4_AM_SHIFT                    (8U)
/*! AM - Address Mode
 *  0b00..Address/Data MUX mode (ADMUX)
 *  0b01..Advanced Address/Data MUX mode (AADM)
 *  0b10..Address/Data non-MUX mode (Non-ADMUX)
 *  0b11..Address/Data non-MUX mode (Non-ADMUX)
 */
#define SEMC_SRAMCR4_AM(x)                       (((uint32_t)(((uint32_t)(x)) << SEMC_SRAMCR4_AM_SHIFT)) & SEMC_SRAMCR4_AM_MASK)

#define SEMC_SRAMCR4_ADVP_MASK                   (0x400U)
#define SEMC_SRAMCR4_ADVP_SHIFT                  (10U)
/*! ADVP - ADV# polarity
 *  0b0..ADV# is active low.
 *  0b1..ADV# is active high.
 */
#define SEMC_SRAMCR4_ADVP(x)                     (((uint32_t)(((uint32_t)(x)) << SEMC_SRAMCR4_ADVP_SHIFT)) & SEMC_SRAMCR4_ADVP_MASK)

#define SEMC_SRAMCR4_ADVH_MASK                   (0x800U)
#define SEMC_SRAMCR4_ADVH_SHIFT                  (11U)
/*! ADVH - ADV# level control during address hold state
 *  0b0..ADV# is high during address hold state.
 *  0b1..ADV# is low during address hold state.
 */
#define SEMC_SRAMCR4_ADVH(x)                     (((uint32_t)(((uint32_t)(x)) << SEMC_SRAMCR4_ADVH_SHIFT)) & SEMC_SRAMCR4_ADVH_MASK)

#define SEMC_SRAMCR4_COL_MASK                    (0xF000U)
#define SEMC_SRAMCR4_COL_SHIFT                   (12U)
/*! COL - Column Address bit width
 *  0b0000..12 Bits
 *  0b0001..11 Bits
 *  0b0010..10 Bits
 *  0b0011..9 Bits
 *  0b0100..8 Bits
 *  0b0101..7 Bits
 *  0b0110..6 Bits
 *  0b0111..5 Bits
 *  0b1000..4 Bits
 *  0b1001..3 Bits
 *  0b1010..2 Bits
 *  0b1011..12 Bits
 *  0b1100..12 Bits
 *  0b1101..12 Bits
 *  0b1110..12 Bits
 *  0b1111..12 Bits
 */
#define SEMC_SRAMCR4_COL(x)                      (((uint32_t)(((uint32_t)(x)) << SEMC_SRAMCR4_COL_SHIFT)) & SEMC_SRAMCR4_COL_MASK)
/*! @} */

/*! @name SRAMCR5 - SRAM Control Register 5 */
/*! @{ */

#define SEMC_SRAMCR5_CES_MASK                    (0xFU)
#define SEMC_SRAMCR5_CES_SHIFT                   (0U)
/*! CES - CE setup time */
#define SEMC_SRAMCR5_CES(x)                      (((uint32_t)(((uint32_t)(x)) << SEMC_SRAMCR5_CES_SHIFT)) & SEMC_SRAMCR5_CES_MASK)

#define SEMC_SRAMCR5_CEH_MASK                    (0xF0U)
#define SEMC_SRAMCR5_CEH_SHIFT                   (4U)
/*! CEH - CE hold time */
#define SEMC_SRAMCR5_CEH(x)                      (((uint32_t)(((uint32_t)(x)) << SEMC_SRAMCR5_CEH_SHIFT)) & SEMC_SRAMCR5_CEH_MASK)

#define SEMC_SRAMCR5_AS_MASK                     (0xF00U)
#define SEMC_SRAMCR5_AS_SHIFT                    (8U)
/*! AS - Address setup time */
#define SEMC_SRAMCR5_AS(x)                       (((uint32_t)(((uint32_t)(x)) << SEMC_SRAMCR5_AS_SHIFT)) & SEMC_SRAMCR5_AS_MASK)

#define SEMC_SRAMCR5_AH_MASK                     (0xF000U)
#define SEMC_SRAMCR5_AH_SHIFT                    (12U)
/*! AH - Address hold time */
#define SEMC_SRAMCR5_AH(x)                       (((uint32_t)(((uint32_t)(x)) << SEMC_SRAMCR5_AH_SHIFT)) & SEMC_SRAMCR5_AH_MASK)

#define SEMC_SRAMCR5_WEL_MASK                    (0xF0000U)
#define SEMC_SRAMCR5_WEL_SHIFT                   (16U)
/*! WEL - WE low time */
#define SEMC_SRAMCR5_WEL(x)                      (((uint32_t)(((uint32_t)(x)) << SEMC_SRAMCR5_WEL_SHIFT)) & SEMC_SRAMCR5_WEL_MASK)

#define SEMC_SRAMCR5_WEH_MASK                    (0xF00000U)
#define SEMC_SRAMCR5_WEH_SHIFT                   (20U)
/*! WEH - WE high time */
#define SEMC_SRAMCR5_WEH(x)                      (((uint32_t)(((uint32_t)(x)) << SEMC_SRAMCR5_WEH_SHIFT)) & SEMC_SRAMCR5_WEH_MASK)

#define SEMC_SRAMCR5_REL_MASK                    (0xF000000U)
#define SEMC_SRAMCR5_REL_SHIFT                   (24U)
/*! REL - RE low time */
#define SEMC_SRAMCR5_REL(x)                      (((uint32_t)(((uint32_t)(x)) << SEMC_SRAMCR5_REL_SHIFT)) & SEMC_SRAMCR5_REL_MASK)

#define SEMC_SRAMCR5_REH_MASK                    (0xF0000000U)
#define SEMC_SRAMCR5_REH_SHIFT                   (28U)
/*! REH - RE high time */
#define SEMC_SRAMCR5_REH(x)                      (((uint32_t)(((uint32_t)(x)) << SEMC_SRAMCR5_REH_SHIFT)) & SEMC_SRAMCR5_REH_MASK)
/*! @} */

/*! @name SRAMCR6 - SRAM Control Register 6 */
/*! @{ */

#define SEMC_SRAMCR6_WDS_MASK                    (0xFU)
#define SEMC_SRAMCR6_WDS_SHIFT                   (0U)
/*! WDS - Write Data setup time */
#define SEMC_SRAMCR6_WDS(x)                      (((uint32_t)(((uint32_t)(x)) << SEMC_SRAMCR6_WDS_SHIFT)) & SEMC_SRAMCR6_WDS_MASK)

#define SEMC_SRAMCR6_WDH_MASK                    (0xF0U)
#define SEMC_SRAMCR6_WDH_SHIFT                   (4U)
/*! WDH - Write Data hold time */
#define SEMC_SRAMCR6_WDH(x)                      (((uint32_t)(((uint32_t)(x)) << SEMC_SRAMCR6_WDH_SHIFT)) & SEMC_SRAMCR6_WDH_MASK)

#define SEMC_SRAMCR6_TA_MASK                     (0xF00U)
#define SEMC_SRAMCR6_TA_SHIFT                    (8U)
/*! TA - Turnaround time */
#define SEMC_SRAMCR6_TA(x)                       (((uint32_t)(((uint32_t)(x)) << SEMC_SRAMCR6_TA_SHIFT)) & SEMC_SRAMCR6_TA_MASK)

#define SEMC_SRAMCR6_AWDH_MASK                   (0xF000U)
#define SEMC_SRAMCR6_AWDH_SHIFT                  (12U)
/*! AWDH - Address to write data hold time */
#define SEMC_SRAMCR6_AWDH(x)                     (((uint32_t)(((uint32_t)(x)) << SEMC_SRAMCR6_AWDH_SHIFT)) & SEMC_SRAMCR6_AWDH_MASK)

#define SEMC_SRAMCR6_LC_MASK                     (0xF0000U)
#define SEMC_SRAMCR6_LC_SHIFT                    (16U)
/*! LC - Latency count */
#define SEMC_SRAMCR6_LC(x)                       (((uint32_t)(((uint32_t)(x)) << SEMC_SRAMCR6_LC_SHIFT)) & SEMC_SRAMCR6_LC_MASK)

#define SEMC_SRAMCR6_RD_MASK                     (0xF00000U)
#define SEMC_SRAMCR6_RD_SHIFT                    (20U)
/*! RD - Read time */
#define SEMC_SRAMCR6_RD(x)                       (((uint32_t)(((uint32_t)(x)) << SEMC_SRAMCR6_RD_SHIFT)) & SEMC_SRAMCR6_RD_MASK)

#define SEMC_SRAMCR6_CEITV_MASK                  (0xF000000U)
#define SEMC_SRAMCR6_CEITV_SHIFT                 (24U)
/*! CEITV - CE# interval time */
#define SEMC_SRAMCR6_CEITV(x)                    (((uint32_t)(((uint32_t)(x)) << SEMC_SRAMCR6_CEITV_SHIFT)) & SEMC_SRAMCR6_CEITV_MASK)

#define SEMC_SRAMCR6_RDH_MASK                    (0xF0000000U)
#define SEMC_SRAMCR6_RDH_SHIFT                   (28U)
/*! RDH - Read hold time */
#define SEMC_SRAMCR6_RDH(x)                      (((uint32_t)(((uint32_t)(x)) << SEMC_SRAMCR6_RDH_SHIFT)) & SEMC_SRAMCR6_RDH_MASK)
/*! @} */

